# Introduction to DataFrames

Dataframes are essentially tables of information, like those traditionally seen in Excel. They are one of the most common forms of storing data, particularly for data-visulatisation, statistical analysisand machine-learning.

Pandas (Python Data Analysis Library) is an open-source package for python that allows the user to easily create and manipulate DataFrames. Many other packages now use pandas DataFrames as a means for inputting information.

## 1. Resources

#### Pandas website

The website for pandas is https://pandas.pydata.org/. It contains extensive documentation about all the commands you can use as well as tutorials for getting started. In fact we will be loosely following their '10 minutes to Pandas' guide, which you can find here

* https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html

#### Other resources

Again, you will be able to find many blogposts and youtube videos giving both introductory and advanced tutorials on Pandas, here are two for example

* https://www.youtube.com/watch?v=e60ItwlZTKM
* https://www.youtube.com/watch?v=vmEHCJofslg

#### General advice

Once you become accustomed to the sytax and methodology that pandas uses, the workflow of dataframes becomes very quick and natural. However this can take some practice and many people (including programming experts) can struggle at the beggining. They may have an idea of the objective they wish to achieve, but don't know how to do it, or use a method that is very cumbersome compared to inbuilt pandas method that accomplish the same feat in a quicker and more elegant manner.

Fortunately pandas has a very active community online and it is a very strong possibility that the problem you will inevitably encounter has also been encountered by numerous other people and remedied on various internet forums. Do not be afraid to Google your problem - often the first two or three hits will bring back explanations of ways how to solve it. Be aware that there are often many ways to get to the same solution.

## 2. Outline

In the current session we will learn about

1. Creating Dataframes
2. Viewing the data
3. Selecting/filtering data
4. Reassigning data

## 3. Creating DataFrames

#### Importing pandas
In order to use pandas we must use the `import` statement, as below. We only need to do this once in a notebook, however you must run that cell before any of the others, otherwise you will get an error. In fact, try running another cell beforehand to see what happens, then do it again after running the one with the import command.

#### Series
The first thing we are going to create is a series, this is essentially an ordered list of data. For example, a list of names

In [193]:
import pandas as pd

names = pd.Series(['Ada', 'Alan', 'Isaac', 'Rosalind'])

names

0         Ada
1        Alan
2       Isaac
3    Rosalind
dtype: object

#### Dataframes

As aluded to in the beginning, dataframes are tables of information. In the pandas world they are collections of series, where each column of the table is a series (i.e. an ordered list of data).

There are numerous ways of creating dataframes in pandas, all of them require using the `DataFrame` object. Below are two examples.

In [194]:
df1 = pd.DataFrame([['Lovelace', 35], ['Turing', 15], 
                          ['Newton', 35], ['Franklin', 15]], columns=['Surname', 'Hours'])

df1

    Surname  Hours
0  Lovelace     35
1    Turing     15
2    Newton     35
3  Franklin     15

In [195]:
df2 = pd.DataFrame({'Department': ['Computer Science', 'Mathematics', 'Physics', 'Chemistry'],
                   'Years Service': [5.1, 7.3, 3.9, 9.2],
                   'EmployeeID': [1, 2, 3, 4]})

df2

         Department  Years Service  EmployeeID
0  Computer Science            5.1           1
1       Mathematics            7.3           2
2           Physics            3.9           3
3         Chemistry            9.2           4

We can select an individual column (e.g. 'Years service') of the above dataframe by issuing the command `df2['Years Service']`. When doing so we see that we get a pandas Series back (compare to the names series that we have above)

In [196]:
df2['Years Service']

0    5.1
1    7.3
2    3.9
3    9.2
Name: Years Service, dtype: float64

## 4. Viewing dataframes

Pandas has a number of commands that allow us to quickly view our data and characteristics of our data in meaningful ways. However before proceeding, let us first join our two dataframes together, we come back to more avdance operations for combining dataframes later.

In [197]:
df = df1.join(df2)
df

    Surname  Hours        Department  Years Service  EmployeeID
0  Lovelace     35  Computer Science            5.1           1
1    Turing     15       Mathematics            7.3           2
2    Newton     35           Physics            3.9           3
3  Franklin     15         Chemistry            9.2           4

#### Selecting a few rows

Often we only want to view a few rows of our dataframe in order to get a sense of what it contains. Pandas contain the following commands to help with this

* `dataframe.head(n)` - returns the first n rows
* `dataframe.tail(n)` - returns the last n rows
* `dataframe.sample(n)`- returns n randomly sampled rows

In [198]:
df.head(2)

    Surname  Hours        Department  Years Service  EmployeeID
0  Lovelace     35  Computer Science            5.1           1
1    Turing     15       Mathematics            7.3           2

In [199]:
df.tail(3)

    Surname  Hours   Department  Years Service  EmployeeID
1    Turing     15  Mathematics            7.3           2
2    Newton     35      Physics            3.9           3
3  Franklin     15    Chemistry            9.2           4

In [200]:
df.sample(2)

  Surname  Hours   Department  Years Service  EmployeeID
1  Turing     15  Mathematics            7.3           2
2  Newton     35      Physics            3.9           3

#### Getting help

Try putting a number of more than 4 in the above command. You will receive an error because we only have 4 entries and so we can't get more samples than that.

Sppose that we didn't care about getting duplicate records in our sample, one way to see if we can accomplish that is asking python for help. If you want to find out more about a certain command, you can write help(command). Run the cell below to see what python gives back for the sample method mentioned above.

In [201]:
help(df.sample)

Help on method sample in module pandas.core.generic:

sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None) method of pandas.core.frame.DataFrame instance
    Return a random sample of items from an axis of object.

    You can use `random_state` for reproducibility.

    Parameters
    ----------
    n : int, optional
        Number of items from axis to return. Cannot be used with `frac`.
        Default = 1 if `frac` = None.
    frac : float, optional
        Fraction of axis items to return. Cannot be used with `n`.
    replace : bool, default False
        Sample with or without replacement.
    weights : str or ndarray-like, optional
        Default 'None' results in equal probability weighting.
        If passed a Series, will align with target object on index. Index
        values in weights not found in sampled object will be ignored and
        index values in sampled object not in weights will be assigned
        weights of zero.
        If called on a DataFrame, will accept the name of a column
        when axis = 0.
        Unless weights are a Series, weights must be same length as axis
        being sampled.
        If weights do not sum to 1, they will be normalized to sum to 1.
        Missing values in the weights column will be treated as zero.
        Infinite values not allowed.
    random_state : int or numpy.random.RandomState, optional
        Seed for the random number generator (if int), or numpy RandomState
        object.
    axis : int or string, optional
        Axis to sample. Accepts axis number or name. Default is stat axis
        for given data type (0 for Series and DataFrames).

    Returns
    -------
    Series or DataFrame
        A new object of same type as caller containing `n` items randomly
        sampled from the caller object.

    See Also
    --------
    numpy.random.choice: Generates a random sample from a given 1-D numpy
        array.

    Examples
    --------
    >>> df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
    ...                    'num_wings': [2, 0, 0, 0],
    ...                    'num_specimen_seen': [10, 2, 1, 8]},
    ...                   index=['falcon', 'dog', 'spider', 'fish'])
    >>> df
            num_legs  num_wings  num_specimen_seen
    falcon         2          2                 10
    dog            4          0                  2
    spider         8          0                  1
    fish           0          0                  8

    Extract 3 random elements from the ``Series`` ``df['num_legs']``:
    Note that we use `random_state` to ensure the reproducibility of
    the examples.

    >>> df['num_legs'].sample(n=3, random_state=1)
    fish      0
    spider    8
    falcon    2
    Name: num_legs, dtype: int64

    A random 50% sample of the ``DataFrame`` with replacement:

    >>> df.sample(frac=0.5, replace=True, random_state=1)
          num_legs  num_wings  num_specimen_seen
    dog          4          0                  2
    fish         0          0                  8

    Using a DataFrame column as weights. Rows with larger value in the
    `num_specimen_seen` column are more likely to be sampled.

    >>> df.sample(n=2, weights='num_specimen_seen', random_state=1)
            num_legs  num_wings  num_specimen_seen
    falcon         2          2                 10
    fish           0          0                  8

In the help information above we see there is a parameter called replace, this has a defaulte value `replace=False`. We can change that by inserting  the phrase `replace=True` into the previous command, this will allow us to get more samples.

In [202]:
df.sample(10, replace=True)

    Surname  Hours        Department  Years Service  EmployeeID
3  Franklin     15         Chemistry            9.2           4
2    Newton     35           Physics            3.9           3
2    Newton     35           Physics            3.9           3
3  Franklin     15         Chemistry            9.2           4
2    Newton     35           Physics            3.9           3
1    Turing     15       Mathematics            7.3           2
2    Newton     35           Physics            3.9           3
1    Turing     15       Mathematics            7.3           2
2    Newton     35           Physics            3.9           3
0  Lovelace     35  Computer Science            5.1           1

#### Summarising information

Pandas has numerous commands for quickly viewing summarising information about the dataframe. A couple of common ones are

* `dataframe.dtype` - This will tell you the type of information in each column of your dataframe, for example whether they are text (called objects), integers (int) or floats (numbers with decimal points in them)
* `dataframe.describe()` - For columns containing numerical information this gives basic statistics like counts, mean, standard deviation, minimum/maximum values and important percentiles

In [203]:
df.dtypes

Surname           object
Hours              int64
Department        object
Years Service    float64
EmployeeID         int64
dtype: object

In [204]:
df.describe()

           Hours  Years Service  EmployeeID
count   4.000000       4.000000    4.000000
mean   25.000000       6.375000    2.500000
std    11.547005       2.351418    1.290994
min    15.000000       3.900000    1.000000
25%    15.000000       4.800000    1.750000
50%    25.000000       6.200000    2.500000
75%    35.000000       7.775000    3.250000
max    35.000000       9.200000    4.000000

## 5. Indexing

In the above print outs the rows have been number from 0 to 3. This is the default way that pandas number the rows. To view the index we can write `dataframe.index`

In [205]:
df.index

RangeIndex(start=0, stop=4, step=1)

However it is possible to change the index should you so wish. For example, we might want to number the rows by the Employee ID instead. To do this we can

In [206]:
df.set_index('EmployeeID')

             Surname  Hours        Department  Years Service
EmployeeID
1           Lovelace     35  Computer Science            5.1
2             Turing     15       Mathematics            7.3
3             Newton     35           Physics            3.9
4           Franklin     15         Chemistry            9.2

**REMEMBER:** The command `df.set_index('EmployeeID')` written above will only show you what the dataframe looks like with the new index, it will not update the dataframe itself. To see that is the case now create a new cell below with the command `df`. You will get the old dataframe back.

In order to update the dataframe itself, you must reassign it. For example,
```
df = df.set_index('EmployeeID')
```

In [207]:
df = df.set_index('EmployeeID')
df

             Surname  Hours        Department  Years Service
EmployeeID
1           Lovelace     35  Computer Science            5.1
2             Turing     15       Mathematics            7.3
3             Newton     35           Physics            3.9
4           Franklin     15         Chemistry            9.2

You can reset the index by simply writing `dataframe.reset_index()`

In [208]:
df = df.reset_index()

## 6. Selecting data from the dataframe

There are a number of very useful methods for obtaining certain parts of the dataframe. Often this is known as **filtering**. We will quickly explore the four different methods that can be employed within pandas.

#### 6.1. Getting

This is where we explicitly state which rows or columns we would like to select.

##### Selecting columns

We have already seen how to select a simple columns, but one may also specify multiple columns

In [209]:
df[['Surname', 'Department']]

    Surname        Department
0  Lovelace  Computer Science
1    Turing       Mathematics
2    Newton           Physics
3  Franklin         Chemistry

##### Selecting columns

This is done by specifying a starting row and end row from the index. Note that, by convention, the end row will not be included.

In [210]:
df[0:2]

   EmployeeID   Surname  Hours        Department  Years Service
0           1  Lovelace     35  Computer Science            5.1
1           2    Turing     15       Mathematics            7.3

#### 6.2. Selecting by label

By using the `dataframe.loc[]` syntax we can simultaneously select certain rows and columns by specifying the **labels** of the rows and the index, for example

In [211]:
df.loc[[0, 3], ['Surname', 'Department']]

    Surname        Department
0  Lovelace  Computer Science
3  Franklin         Chemistry

**Exercise:** To reinforce the above point, create a new dataframe and set the index to be the surname. Then attempt to select the 'Years Service' and 'Hours' columns for Newton and Franklin

#### 6.3. Selecting by position

If we know the exact positions of the data we are interested in we can specify the appropriate numbers, for example, if we know that the columns 'EmployeeID' and 'Hours' are the first and third (0 and 2 in python ordering) we can use the `iloc` command instead of `loc`. This stands for integer location.

In [212]:
df.iloc[2:4, [0, 2]]

   EmployeeID  Hours
2           3     35
3           4     15

#### 6.4. Logical selecting

Probably the most powerful form of selecting information within pandas is with logical specification. Since it might be the most confusing for those new to programming, we attempt to understand this step by step.

Firstly, we note that in python we can issue logical commands. These return either a true or false value, for example we can ask whether a number is either more than, less than, equal to, or not equal to something else.

In [213]:
x = 7
x > 6

True

In [214]:
x < 5

False

In [215]:
x == 9

False

In [216]:
x != 10

True

The same idea hold in pandas. This time we can ask for a series (a single column in a dataframe) or for a dataframe whether a certain statement holds. For example below we can ask from the 'Years Service' column, which entries are more than 6.

In [217]:
df['Years Service'] > 6

0    False
1     True
2    False
3     True
Name: Years Service, dtype: bool

We receive back a series containing either `True` or `False` values (note the series type, which is bool - short for Boolean). It tells us which rows satisfy this condition. If we want we can record (i.e. assign it to a variable) this series by writing

In [218]:
my_records = df['Years Service'] > 6
my_records

0    False
1     True
2    False
3     True
Name: Years Service, dtype: bool

Now we can use this series to select certain rows in our dataframe, for example the command below will return all rows for which the employee has more than 6 years service

In [219]:
df[my_records]

   EmployeeID   Surname  Hours   Department  Years Service
1           2    Turing     15  Mathematics            7.3
3           4  Franklin     15    Chemistry            9.2

We can also combine the above commands into a single line if we wish, which will give the same result

In [220]:
df[df['Years Service']>6]

   EmployeeID   Surname  Hours   Department  Years Service
1           2    Turing     15  Mathematics            7.3
3           4  Franklin     15    Chemistry            9.2

**Exercise:**

1. Select those rows in which the hours are less than 20.
2. Select those rows where the department is not Chemistry
3. Using the loc syntax, select those rows where the employee ID is more than 1 with columns 'Employee ID', 'Surname' and 'Years Service'

## 7. Setting and adding to the dataframe

The final class of pandas operations involve manipulating the data, by either adding to the dataframe or changing what is already there. As we will see, the syntax does not change very much between the two

#### 7.1 Adding data to the dataframe

Very often we might want to add whole rows or columns to the dataframe.

##### Adding columns
pandas allows us to do that easily by specifying the new column and setting it equal to an appropriate object, examples include

A pandas series

In [221]:
df['First Name'] = names

Manipulated pandas series, for example other columns from the same dataframe

In [222]:
df['Total hours'] = 365*df['Hours']*df['Years Service']

A single number (will be assigned to every row in the columns), this could also be a string (i.e. text) or a True/False value.

In [223]:
df['Awards'] = 1

A python list, which can contain anything you want. The length of the list must be the same as the number of rows however.

In [224]:
df['students'] = [1, 9, 2, 3.5]

In [225]:
df

,EmployeeID,Surname,Hours,Department,Years Service,First Name,Total hours,Awards,students
0,1,Lovelace,35,Computer Science,5.1,Ada,65152.5,1,1.0
1,2,Turing,15,Mathematics,7.3,Alan,39967.5,1,9.0
2,3,Newton,35,Physics,3.9,Isaac,49822.5,1,2.0
3,4,Franklin,15,Chemistry,9.2,Rosalind,50370.0,1,3.5

##### Adding rows

In this case, we must use the loc syntax to specify a label for the new row, but again we can either assign a constant value

In [226]:
df.loc[4] = 0

Or a list

In [227]:
df.loc[5] = [9, 'Maxwell', 30, 'Physics', 4.2, 'James Clerk', 76, 2, 2]

In [228]:
df

,EmployeeID,Surname,Hours,Department,Years Service,First Name,Total hours,Awards,students
0,1,Lovelace,35,Computer Science,5.1,Ada,65152.5,1,1.0
1,2,Turing,15,Mathematics,7.3,Alan,39967.5,1,9.0
2,3,Newton,35,Physics,3.9,Isaac,49822.5,1,2.0
3,4,Franklin,15,Chemistry,9.2,Rosalind,50370.0,1,3.5
4,0,0,0,0,0.0,0,0.0,0,0.0
5,9,Maxwell,30,Physics,4.2,James Clerk,76.0,2,2.0

#### 7.2 Changing data in a dataframe

Fortunately, the syntax we have just come across above works if we want to change the data that is already there, for instance we can go back and add the data for row 4

In [229]:
df.loc[4] = [17, 'Darwin', 30, 'Biology', 9.8, 'Charles', 38, 3, 1]

We now notice that the entries in 'Total Hours' are not correct for our most recent additions, fortunately we can change these by using the same command as above, this time to change the data, rather than add it

In [230]:
df['Total hours'] = 365*df['Hours']*df['Years Service']

In [231]:
df

,EmployeeID,Surname,Hours,Department,Years Service,First Name,Total hours,Awards,students
0,1,Lovelace,35,Computer Science,5.1,Ada,65152.5,1,1.0
1,2,Turing,15,Mathematics,7.3,Alan,39967.5,1,9.0
2,3,Newton,35,Physics,3.9,Isaac,49822.5,1,2.0
3,4,Franklin,15,Chemistry,9.2,Rosalind,50370.0,1,3.5
4,17,Darwin,30,Biology,9.8,Charles,107310.0,3,1.0
5,9,Maxwell,30,Physics,4.2,James Clerk,45990.0,2,2.0

And here are a couple examples where we use logical indexing to change certain cells in our dataframe

In [233]:
# - Giving Rosalind Franklin 4 awards
df.loc[df['Surname']=='Franklin', 'Awards'] = 4

In [235]:
# - Giving those employees with at most 2 students another student
df.loc[df['students']<=2, 'students'] += 1

In [236]:
df

,EmployeeID,Surname,Hours,Department,Years Service,First Name,Total hours,Awards,students
0,1,Lovelace,35,Computer Science,5.1,Ada,65152.5,1,2.0
1,2,Turing,15,Mathematics,7.3,Alan,39967.5,1,9.0
2,3,Newton,35,Physics,3.9,Isaac,49822.5,1,3.0
3,4,Franklin,15,Chemistry,9.2,Rosalind,50370.0,4,3.5
4,17,Darwin,30,Biology,9.8,Charles,107310.0,3,2.0
5,9,Maxwell,30,Physics,4.2,James Clerk,45990.0,2,3.0